{
   "class_name": "Functional",
   "config": {
      "name": "model",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  5,
                  45
               ],
               "dtype": "int32",
               "sparse": false,
               "ragged": false,
               "name": "input_block"
            },
            "name": "input_block",
            "inbound_nodes": []
         },
         {
            "class_name": "Embedding",
            "config": {
               "name": "embed",
               "trainable": true,
               "batch_input_shape": [
                  null,
                  45
               ],
               "dtype": "float32",
               "input_dim": 7518,
               "output_dim": 300,
               "embeddings_initializer": {
                  "class_name": "RandomUniform",
                  "config": {
                     "minval": -0.05,
                     "maxval": 0.05,
                     "seed": null
                  }
               },
               "embeddings_regularizer": null,
               "activity_regularizer": null,
               "embeddings_constraint": null,
               "mask_zero": false,
               "input_length": 45
            },
            "name": "embed",
            "inbound_nodes": [
               [
                  [
                     "input_block",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "embed_batch_norm",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  3
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "embed_batch_norm",
            "inbound_nodes": [
               [
                  [
                     "embed",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "time_distributed",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Conv1D",
                  "config": {
                     "name": "conv1d_0",
                     "trainable": true,
                     "dtype": "float32",
                     "filters": 64,
                     "kernel_size": [
                        3
                     ],
                     "strides": [
                        1
                     ],
                     "padding": "valid",
                     "data_format": "channels_last",
                     "dilation_rate": [
                        1
                     ],
                     "groups": 1,
                     "activation": "relu",
                     "use_bias": true,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        }
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                     },
                     "kernel_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "bias_constraint": null
                  }
               }
            },
            "name": "time_distributed",
            "inbound_nodes": [
               [
                  [
                     "embed_batch_norm",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "time_distributed_1",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Conv1D",
                  "config": {
                     "name": "conv1d_1",
                     "trainable": true,
                     "dtype": "float32",
                     "filters": 64,
                     "kernel_size": [
                        3
                     ],
                     "strides": [
                        1
                     ],
                     "padding": "valid",
                     "data_format": "channels_last",
                     "dilation_rate": [
                        1
                     ],
                     "groups": 1,
                     "activation": "relu",
                     "use_bias": true,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        }
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                     },
                     "kernel_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "bias_constraint": null
                  }
               }
            },
            "name": "time_distributed_1",
            "inbound_nodes": [
               [
                  [
                     "time_distributed",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.46988024962307223,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout",
            "inbound_nodes": [
               [
                  [
                     "time_distributed_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "time_distributed_2",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Flatten",
                  "config": {
                     "name": "flatten",
                     "trainable": true,
                     "dtype": "float32",
                     "data_format": "channels_last"
                  }
               }
            },
            "name": "time_distributed_2",
            "inbound_nodes": [
               [
                  [
                     "dropout",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Bidirectional",
            "config": {
               "name": "bidirectional",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "GRU",
                  "config": {
                     "name": "gru",
                     "trainable": true,
                     "dtype": "float32",
                     "return_sequences": true,
                     "return_state": false,
                     "go_backwards": false,
                     "stateful": false,
                     "unroll": false,
                     "time_major": false,
                     "units": 128,
                     "activation": "tanh",
                     "recurrent_activation": "sigmoid",
                     "use_bias": true,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        },
                        "shared_object_id": 19
                     },
                     "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                           "gain": 1.0,
                           "seed": null
                        },
                        "shared_object_id": 20
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {},
                        "shared_object_id": 21
                     },
                     "kernel_regularizer": null,
                     "recurrent_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "recurrent_constraint": null,
                     "bias_constraint": null,
                     "dropout": 0.0,
                     "recurrent_dropout": 0.0,
                     "implementation": 2,
                     "reset_after": true
                  }
               },
               "merge_mode": "concat"
            },
            "name": "bidirectional",
            "inbound_nodes": [
               [
                  [
                     "time_distributed_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Bidirectional",
            "config": {
               "name": "bidirectional_1",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "GRU",
                  "config": {
                     "name": "gru_1",
                     "trainable": true,
                     "dtype": "float32",
                     "return_sequences": false,
                     "return_state": false,
                     "go_backwards": false,
                     "stateful": false,
                     "unroll": false,
                     "time_major": false,
                     "units": 64,
                     "activation": "tanh",
                     "recurrent_activation": "sigmoid",
                     "use_bias": true,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        },
                        "shared_object_id": 25
                     },
                     "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                           "gain": 1.0,
                           "seed": null
                        },
                        "shared_object_id": 26
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {},
                        "shared_object_id": 27
                     },
                     "kernel_regularizer": null,
                     "recurrent_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "recurrent_constraint": null,
                     "bias_constraint": null,
                     "dropout": 0.0,
                     "recurrent_dropout": 0.0,
                     "implementation": 2,
                     "reset_after": true
                  }
               },
               "merge_mode": "concat"
            },
            "name": "bidirectional_1",
            "inbound_nodes": [
               [
                  [
                     "bidirectional",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense",
               "trainable": true,
               "dtype": "float32",
               "units": 3,
               "activation": "softmax",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
               [
                  [
                     "bidirectional_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         }
      ],
      "input_layers": [
         [
            "input_block",
            0,
            0
         ]
      ],
      "output_layers": [
         [
            "dense",
            0,
            0
         ]
      ]
   },
   "keras_version": "2.9.0",
   "backend": "tensorflow"
}