{
   "class_name": "Functional",
   "config": {
      "name": "model",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  3,
                  45
               ],
               "dtype": "int32",
               "sparse": false,
               "ragged": false,
               "name": "input_block"
            },
            "name": "input_block",
            "inbound_nodes": []
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "time_distributed",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Embedding",
                  "config": {
                     "name": "embed",
                     "trainable": true,
                     "batch_input_shape": [
                        null,
                        null
                     ],
                     "dtype": "float32",
                     "input_dim": 7518,
                     "output_dim": 225,
                     "embeddings_initializer": {
                        "class_name": "RandomUniform",
                        "config": {
                           "minval": -0.05,
                           "maxval": 0.05,
                           "seed": null
                        }
                     },
                     "embeddings_regularizer": null,
                     "activity_regularizer": null,
                     "embeddings_constraint": null,
                     "mask_zero": true,
                     "input_length": null
                  }
               }
            },
            "name": "time_distributed",
            "inbound_nodes": [
               [
                  [
                     "input_block",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "time_distributed_1",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Bidirectional",
                  "config": {
                     "name": "bidirectional",
                     "trainable": true,
                     "dtype": "float32",
                     "layer": {
                        "class_name": "LSTM",
                        "config": {
                           "name": "BiLSTM_0",
                           "trainable": true,
                           "dtype": "float32",
                           "return_sequences": true,
                           "return_state": false,
                           "go_backwards": false,
                           "stateful": false,
                           "unroll": false,
                           "time_major": false,
                           "units": 96,
                           "activation": "tanh",
                           "recurrent_activation": "sigmoid",
                           "use_bias": true,
                           "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                 "seed": null
                              },
                              "shared_object_id": 4
                           },
                           "recurrent_initializer": {
                              "class_name": "Orthogonal",
                              "config": {
                                 "gain": 1.0,
                                 "seed": null
                              },
                              "shared_object_id": 5
                           },
                           "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {},
                              "shared_object_id": 6
                           },
                           "unit_forget_bias": true,
                           "kernel_regularizer": null,
                           "recurrent_regularizer": null,
                           "bias_regularizer": null,
                           "activity_regularizer": null,
                           "kernel_constraint": null,
                           "recurrent_constraint": null,
                           "bias_constraint": null,
                           "dropout": 0.0,
                           "recurrent_dropout": 0.0,
                           "implementation": 2
                        }
                     },
                     "merge_mode": "concat"
                  }
               }
            },
            "name": "time_distributed_1",
            "inbound_nodes": [
               [
                  [
                     "time_distributed",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "time_distributed_2",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Bidirectional",
                  "config": {
                     "name": "bidirectional_1",
                     "trainable": true,
                     "dtype": "float32",
                     "layer": {
                        "class_name": "LSTM",
                        "config": {
                           "name": "BiLSTM_1",
                           "trainable": true,
                           "dtype": "float32",
                           "return_sequences": false,
                           "return_state": false,
                           "go_backwards": false,
                           "stateful": false,
                           "unroll": false,
                           "time_major": false,
                           "units": 96,
                           "activation": "tanh",
                           "recurrent_activation": "sigmoid",
                           "use_bias": true,
                           "kernel_initializer": {
                              "class_name": "GlorotUniform",
                              "config": {
                                 "seed": null
                              },
                              "shared_object_id": 11
                           },
                           "recurrent_initializer": {
                              "class_name": "Orthogonal",
                              "config": {
                                 "gain": 1.0,
                                 "seed": null
                              },
                              "shared_object_id": 12
                           },
                           "bias_initializer": {
                              "class_name": "Zeros",
                              "config": {},
                              "shared_object_id": 13
                           },
                           "unit_forget_bias": true,
                           "kernel_regularizer": null,
                           "recurrent_regularizer": null,
                           "bias_regularizer": null,
                           "activity_regularizer": null,
                           "kernel_constraint": null,
                           "recurrent_constraint": null,
                           "bias_constraint": null,
                           "dropout": 0.0,
                           "recurrent_dropout": 0.0,
                           "implementation": 2
                        }
                     },
                     "merge_mode": "concat"
                  }
               }
            },
            "name": "time_distributed_2",
            "inbound_nodes": [
               [
                  [
                     "time_distributed_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "Dense_0",
               "trainable": true,
               "dtype": "float32",
               "units": 96,
               "activation": "relu",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "Dense_0",
            "inbound_nodes": [
               [
                  [
                     "time_distributed_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "Drop_0",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.41214594725673526,
               "noise_shape": null,
               "seed": null
            },
            "name": "Drop_0",
            "inbound_nodes": [
               [
                  [
                     "Dense_0",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "Dense_1",
               "trainable": true,
               "dtype": "float32",
               "units": 48,
               "activation": "relu",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "Dense_1",
            "inbound_nodes": [
               [
                  [
                     "Drop_0",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense_final",
               "trainable": true,
               "dtype": "float32",
               "units": 3,
               "activation": "softmax",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense_final",
            "inbound_nodes": [
               [
                  [
                     "Dense_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "SlicingOpLambda",
            "config": {
               "name": "tf.__operators__.getitem",
               "trainable": true,
               "dtype": "float32",
               "function": "__operators__.getitem"
            },
            "name": "tf.__operators__.getitem",
            "inbound_nodes": [
               [
                  "dense_final",
                  0,
                  0,
                  {
                     "slice_spec": [
                        {
                           "start": null,
                           "stop": null,
                           "step": null
                        },
                        1
                     ]
                  }
               ]
            ]
         }
      ],
      "input_layers": [
         [
            "input_block",
            0,
            0
         ]
      ],
      "output_layers": [
         [
            "tf.__operators__.getitem",
            0,
            0
         ]
      ]
   },
   "keras_version": "2.9.0",
   "backend": "tensorflow"
}